yii/controllers/IndexController.php

    public function actionL_add(){
    	$liuyan=new Liuyan();
    	$content=$_GET['content'];
    	//echo $content;die;
    	$time=date("Y-m-d H:i:s",time());
    	$liuyan->content=$content;
    	$liuyan->time=$time;
    	$info=$liuyan->save();
---
INSERT INTO `liuyan` (`content`, `time`) VALUES ('å²³å† æ–\°', '2016-03-24 11:00:09')

    public function actionL_del(){
    	$liuyan=new Liuyan();
    	$id=$_GET['id'];
    	//echo $id;die;
    	$info=$liuyan->findOne($id)->delete();
---
DELETE FROM `liuyan` WHERE `id`=37
SELECT * FROM `liuyan` WHERE `id`='37'

    public function actionL_update(){
    	$liuyan=new Liuyan();
    	$id=$_GET['id'];
    	//echo $id;die;
    	//$id=2;
    	$info=$liuyan->find()->where("id='".$id."'")->one();
---
SELECT * FROM `liuyan` WHERE `id`='3'